RT-Thread/rt-thread/bsp/nxp/S32K3/S32K344/libraries/BaseNXP_TS_T40D34M50I0R0/header/S32K344_DMA_TCD.h
#define DMA_TCD_CH14_ES_DAE_MASK                 (0x20U)
#define DMA_TCD_CH14_ES_DAE_SHIFT                (5U)
#define DMA_TCD_CH14_ES_DAE_WIDTH                (1U)
#define DMA_TCD_CH14_ES_DAE(x)                   (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH14_ES_DAE_SHIFT)) & DMA_TCD_CH14_ES_DAE_MASK)

#define DMA_TCD_CH14_ES_SOE_MASK                 (0x40U)
#define DMA_TCD_CH14_ES_SOE_SHIFT                (6U)
#define DMA_TCD_CH14_ES_SOE_WIDTH                (1U)
#define DMA_TCD_CH14_ES_SOE(x)                   (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH14_ES_SOE_SHIFT)) & DMA_TCD_CH14_ES_SOE_MASK)

#define DMA_TCD_CH14_ES_SAE_MASK                 (0x80U)
#define DMA_TCD_CH14_ES_SAE_SHIFT                (7U)
#define DMA_TCD_CH14_ES_SAE_WIDTH                (1U)
#define DMA_TCD_CH14_ES_SAE(x)                   (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH14_ES_SAE_SHIFT)) & DMA_TCD_CH14_ES_SAE_MASK)

#define DMA_TCD_CH14_ES_ERR_MASK                 (0x80000000U)
#define DMA_TCD_CH14_ES_ERR_SHIFT                (31U)
#define DMA_TCD_CH14_ES_ERR_WIDTH                (1U)
#define DMA_TCD_CH14_ES_ERR(x)                   (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH14_ES_ERR_SHIFT)) & DMA_TCD_CH14_ES_ERR_MASK)
/*! @} */

/*! @name CH14_INT - Channel Interrupt Status */
/*! @{ */

#define DMA_TCD_CH14_INT_INT_MASK                (0x1U)
#define DMA_TCD_CH14_INT_INT_SHIFT               (0U)
#define DMA_TCD_CH14_INT_INT_WIDTH               (1U)
#define DMA_TCD_CH14_INT_INT(x)                  (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH14_INT_INT_SHIFT)) & DMA_TCD_CH14_INT_INT_MASK)
/*! @} */

/*! @name CH14_SBR - Channel System Bus */
/*! @{ */

#define DMA_TCD_CH14_SBR_MID_MASK                (0xFU)
#define DMA_TCD_CH14_SBR_MID_SHIFT               (0U)
#define DMA_TCD_CH14_SBR_MID_WIDTH               (4U)
#define DMA_TCD_CH14_SBR_MID(x)                  (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH14_SBR_MID_SHIFT)) & DMA_TCD_CH14_SBR_MID_MASK)

#define DMA_TCD_CH14_SBR_PAL_MASK                (0x8000U)
#define DMA_TCD_CH14_SBR_PAL_SHIFT               (15U)
#define DMA_TCD_CH14_SBR_PAL_WIDTH               (1U)
#define DMA_TCD_CH14_SBR_PAL(x)                  (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH14_SBR_PAL_SHIFT)) & DMA_TCD_CH14_SBR_PAL_MASK)

#define DMA_TCD_CH14_SBR_EMI_MASK                (0x10000U)
#define DMA_TCD_CH14_SBR_EMI_SHIFT               (16U)
#define DMA_TCD_CH14_SBR_EMI_WIDTH               (1U)
#define DMA_TCD_CH14_SBR_EMI(x)                  (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH14_SBR_EMI_SHIFT)) & DMA_TCD_CH14_SBR_EMI_MASK)

#define DMA_TCD_CH14_SBR_ATTR_MASK               (0xE0000U)
#define DMA_TCD_CH14_SBR_ATTR_SHIFT              (17U)
#define DMA_TCD_CH14_SBR_ATTR_WIDTH              (3U)
#define DMA_TCD_CH14_SBR_ATTR(x)                 (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH14_SBR_ATTR_SHIFT)) & DMA_TCD_CH14_SBR_ATTR_MASK)
/*! @} */

/*! @name CH14_PRI - Channel Priority */
/*! @{ */

#define DMA_TCD_CH14_PRI_APL_MASK                (0x7U)
#define DMA_TCD_CH14_PRI_APL_SHIFT               (0U)
#define DMA_TCD_CH14_PRI_APL_WIDTH               (3U)
#define DMA_TCD_CH14_PRI_APL(x)                  (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH14_PRI_APL_SHIFT)) & DMA_TCD_CH14_PRI_APL_MASK)

#define DMA_TCD_CH14_PRI_DPA_MASK                (0x40000000U)
#define DMA_TCD_CH14_PRI_DPA_SHIFT               (30U)
#define DMA_TCD_CH14_PRI_DPA_WIDTH               (1U)
#define DMA_TCD_CH14_PRI_DPA(x)                  (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH14_PRI_DPA_SHIFT)) & DMA_TCD_CH14_PRI_DPA_MASK)

#define DMA_TCD_CH14_PRI_ECP_MASK                (0x80000000U)
#define DMA_TCD_CH14_PRI_ECP_SHIFT               (31U)
#define DMA_TCD_CH14_PRI_ECP_WIDTH               (1U)
#define DMA_TCD_CH14_PRI_ECP(x)                  (((uint32_t)(((uint32_t)(x)) << DMA_TCD_CH14_PRI_ECP_SHIFT)) & DMA_TCD_CH14_PRI_ECP_MASK)
/*! @} */

/*! @name TCD14_SADDR - TCD Source Address */
/*! @{ */

#define DMA_TCD_TCD14_SADDR_SADDR_MASK           (0xFFFFFFFFU)
#define DMA_TCD_TCD14_SADDR_SADDR_SHIFT          (0U)
#define DMA_TCD_TCD14_SADDR_SADDR_WIDTH          (32U)
#define DMA_TCD_TCD14_SADDR_SADDR(x)             (((uint32_t)(((uint32_t)(x)) << DMA_TCD_TCD14_SADDR_SADDR_SHIFT)) & DMA_TCD_TCD14_SADDR_SADDR_MASK)
/*! @} */

/*! @name TCD14_SOFF - TCD Signed Source Address Offset */
/*! @{ */

#define DMA_TCD_TCD14_SOFF_SOFF_MASK             (0xFFFFU)
#define DMA_TCD_TCD14_SOFF_SOFF_SHIFT            (0U)
#define DMA_TCD_TCD14_SOFF_SOFF_WIDTH            (16U)
#define DMA_TCD_TCD14_SOFF_SOFF(x)               (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD14_SOFF_SOFF_SHIFT)) & DMA_TCD_TCD14_SOFF_SOFF_MASK)
/*! @} */

/*! @name TCD14_ATTR - TCD Transfer Attributes */
/*! @{ */

#define DMA_TCD_TCD14_ATTR_DSIZE_MASK            (0x7U)
#define DMA_TCD_TCD14_ATTR_DSIZE_SHIFT           (0U)
#define DMA_TCD_TCD14_ATTR_DSIZE_WIDTH           (3U)
#define DMA_TCD_TCD14_ATTR_DSIZE(x)              (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD14_ATTR_DSIZE_SHIFT)) & DMA_TCD_TCD14_ATTR_DSIZE_MASK)

#define DMA_TCD_TCD14_ATTR_DMOD_MASK             (0xF8U)
#define DMA_TCD_TCD14_ATTR_DMOD_SHIFT            (3U)
#define DMA_TCD_TCD14_ATTR_DMOD_WIDTH            (5U)
#define DMA_TCD_TCD14_ATTR_DMOD(x)               (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD14_ATTR_DMOD_SHIFT)) & DMA_TCD_TCD14_ATTR_DMOD_MASK)

#define DMA_TCD_TCD14_ATTR_SSIZE_MASK            (0x700U)
#define DMA_TCD_TCD14_ATTR_SSIZE_SHIFT           (8U)
#define DMA_TCD_TCD14_ATTR_SSIZE_WIDTH           (3U)
#define DMA_TCD_TCD14_ATTR_SSIZE(x)              (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD14_ATTR_SSIZE_SHIFT)) & DMA_TCD_TCD14_ATTR_SSIZE_MASK)

#define DMA_TCD_TCD14_ATTR_SMOD_MASK             (0xF800U)
#define DMA_TCD_TCD14_ATTR_SMOD_SHIFT            (11U)
#define DMA_TCD_TCD14_ATTR_SMOD_WIDTH            (5U)
#define DMA_TCD_TCD14_ATTR_SMOD(x)               (((uint16_t)(((uint16_t)(x)) << DMA_TCD_TCD14_ATTR_SMOD_SHIFT)) & DMA_TCD_TCD14_ATTR_SMOD_MASK)
/*! @} */

/*! @name TCD14_NBYTES_MLOFFNO - TCD Transfer Size Without Minor Loop Offsets */
/*! @{ */

#define DMA_TCD_TCD14_NBYTES_MLOFFNO_NBYTES_MASK (0x3FFFFFFFU)
#define DMA_TCD_TCD14_NBYTES_MLOFFNO_NBYTES_SHIFT (0U)
#define DMA_TCD_TCD14_NBYTES_MLOFFNO_NBYTES_WIDTH (30U)
#define DMA_TCD_TCD14_NBYTES_MLOFFNO_NBYTES(x)   (((uint32_t)(((uint32_t)(x)) << DMA_TCD_TCD14_NBYTES_MLOFFNO_NBYTES_SHIFT)) & DMA_TCD_TCD14_NBYTES_MLOFFNO_NBYTES_MASK)

#define DMA_TCD_TCD14_NBYTES_MLOFFNO_DMLOE_MASK  (0x40000000U)
#define DMA_TCD_TCD14_NBYTES_MLOFFNO_DMLOE_SHIFT (30U)
#define DMA_TCD_TCD14_NBYTES_MLOFFNO_DMLOE_WIDTH (1U)
#define DMA_TCD_TCD14_NBYTES_MLOFFNO_DMLOE(x)    (((uint32_t)(((uint32_t)(x)) << DMA_TCD_TCD14_NBYTES_MLOFFNO_DMLOE_SHIFT)) & DMA_TCD_TCD14_NBYTES_MLOFFNO_DMLOE_MASK)

#define DMA_TCD_TCD14_NBYTES_MLOFFNO_SMLOE_MASK  (0x80000000U)
#define DMA_TCD_TCD14_NBYTES_MLOFFNO_SMLOE_SHIFT (31U)
#define DMA_TCD_TCD14_NBYTES_MLOFFNO_SMLOE_WIDTH (1U)
#define DMA_TCD_TCD14_NBYTES_MLOFFNO_SMLOE(x)    (((uint32_t)(((uint32_t)(x)) << DMA_TCD_TCD14_NBYTES_MLOFFNO_SMLOE_SHIFT)) & DMA_TCD_TCD14_NBYTES_MLOFFNO_SMLOE_MASK)
/*! @} */

/*! @name TCD14_NBYTES_MLOFFYES - TCD Transfer Size with Minor Loop Offsets */
/*! @{ */

#define DMA_TCD_TCD14_NBYTES_MLOFFYES_NBYTES_MASK (0x3FFU)
#define DMA_TCD_TCD14_NBYTES_MLOFFYES_NBYTES_SHIFT (0U)
#define DMA_TCD_TCD14_NBYTES_MLOFFYES_NBYTES_WIDTH (10U)
#define DMA_TCD_TCD14_NBYTES_MLOFFYES_NBYTES(x)  (((uint32_t)(((uint32_t)(x)) << DMA_TCD_TCD14_NBYTES_MLOFFYES_NBYTES_SHIFT)) & DMA_TCD_TCD14_NBYTES_MLOFFYES_NBYTES_MASK)

